import math # импортирем библиотеку с математическими операциями
a = int(input('Введите радиус круга в сантиметрах: ')) # Вводим радиус и переводим в целое число
Len = 2*3.14*a # Нахождение длины окружности
S = 3.14 * a * a # Нахождение площади окружности 
site_vp_kvadrata = 2 * a / 1.41 # Нахождение стороны вписанного квадрата
site_vp_treyg = a * 1.73 / 3 # Нахождение стороны вписанного треугольника
site_opis_kvadrata = 2 * a # Нахождение стороны описанного квадрата
site_opis_treyg = 2 * a *1.73 / 3 # Нахождение стороны описанного треугольника
site_opis_vosmiygol = 2 * a * 2.414 # Нахождение стороны описанного восьмиугольника
   # Вывод данных
print(f'Длина окружности: {Len} сантиметров или {Len/100} метров. Площадь равна {S} сантиметров^2 или {S/10000} метров^2')
print(f'Сторона квадрата вписанного в окружность: {site_vp_kvadrata} сантиметров или {site_vp_kvadrata/100} метров. Сторона треугольника вписанного в окружность: {site_vp_treyg} сантиметров или {site_vp_treyg/100} метров')
print(f'Сторона квадрата описанного вокруги окружности: {site_opis_kvadrata} сантиметров или {site_opis_kvadrata/100} метров. Сторона треугольника описанного вокруг окружности: {site_opis_treyg} сантиметров или {site_opis_treyg/100} метров')
print(f'Сторнона восьмиугольника, описанного вокруг окрукжности: {site_opis_vosmiygol} сантиметров или {site_opis_vosmiygol/100} метров')
